Repository: manh354/NumericalAnalysis
Catalog: Properties/string.*.resx
Languages: vi

# ConvertInputSuccess
source: Convert inputs successfully.
vi: Chuyển đổi đầu vào thành công.

# FailedChapter1_FalsePosition_CannotFindMinMax
source: False Position method failed: failed to Find Min Max of f' on (a;b).
vi: Phương pháp dây cung thất bại: Không tìm được Max Min của f' trên (a;b)

# FailedChapter1_Func_ddf
source: Failed Processing function ddf.
vi: Không xử lý được phương trình ddf.

# FailedChapter1_Func_df
source: Failed Processing function df.
vi: Không xử lý được phương trình df.

# FailedChapter1_Func_f
source: Failed Processing function f.
vi: Không xử lý được phương trình f.

# FailedChapter1_SingularIterative_CannotFindMinMax
source: Singular Iterative method failed: failed to find Min Max of f' on (a;b).
vi: Phương pháp lặp đơn thất bại: Không tìm được Max Min của f' trên (a;b)

# FailedChapter1_Var_a
source: Failed Processing variable a.
vi: Không xử lý được biến a.

# FailedChapter1_Var_b
source: Failed Processing variable b.
vi: Không xử lý được biến b.

# FailedChapter1_Var_eps
source: Failed Processing variable eps.
vi: Không xử lý được biến eps.

# NoInputFileChapter1
source: Input file not detected, created file: FunctionInput.txt at .exe containing folder.
vi: Không tìm thấy file dữ liệu đầu vào, đã tạo file FunctionInput.txt tại cùng thư mục chứa file .exe này.

# PleaseRecheckInput
source: Please recheck the input file first and press enter to retry.
vi: Hãy kiểm tra lại dữ liệu của file đầu vào và thử lại.

# TypeInChapter1Switch
source: Type 1 to select Bisection method Type 2 to select False Position method Type 3 to select Newton's method Type 4 to select Singular Iterative method:
vi: Nhập 1 để chọn phương pháp chia đôi, Nhập 2 để chọn phương pháp dây cung Nhập 3 để chọn phương pháp tiếp tuyến Nhập 4 để chọn phương pháp lặp đơn
